chriskinal/QuailTracker/esp32_bridge/src/main.c
/*
 * ESP32-C3 Bridge — SPI Slave + WiFi AP + WebSocket
 *
 * WiFi AP is on continuously by default. Two opt-in power-saving modes
 * (mutually exclusive, configured via the web UI / NVS):
 *   - WiFi duty cycle: 30 s on / 60 s deep sleep
 *   - Laser wake:      sleep until phototransistor on GPIO0 fires
 *
 * Wiring (ESP32-C3 Super Mini):
 *   GPIO4  = SCK
 *   GPIO6  = MOSI (master out, slave in)
 *   GPIO5  = MISO (master in, slave out)
 *   GPIO7  = CS (also used as wake output when STM32 is sleeping)
 */

#include <stdio.h>
#include <string.h>
#include <inttypes.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/spi_slave.h"
#include "driver/gpio.h"
#include "esp_wifi.h"
#include "esp_event.h"
#include "esp_log.h"
#include "esp_http_server.h"
#include "nvs_flash.h"
#include "esp_netif.h"
#include "esp_mac.h"
#include "esp_sleep.h"
#include "esp_ota_ops.h"
#include "lwip/sockets.h"
#include "lwip/netdb.h"
#include "stm32_flash.h"
#include "spi_protocol.h"

#define TAG "BRIDGE"
#define ESP_FW_VERSION "0.3.0"

static bool wifi_started = false;

/* WiFi duty cycle for low-power mode: on 30s, deep sleep 60s.
 * During deep sleep the ESP32 draws ~5µA instead of 44mA.
 * 30s on-time allows for ESP32 boot (~3s) + phone WiFi scan + connect.
 * Disabled by default — WiFi stays on continuously. */
static bool wifi_duty_cycle = false;
static bool laser_wake_enabled = false;
#define WIFI_DUTY_ON_MS    30000
#define WIFI_DUTY_SLEEP_S  60
#define LASER_IDLE_SLEEP_S 30   /* seconds idle before deep sleep in laser wake mode */
#define BOOT_GRACE_MS      180000  /* 3 min always-on after boot for WiFi setup */
#define PIN_LASER_WAKE     0   /* GPIO0: phototransistor for laser wake */
bool spi_initialized = false;
static TaskHandle_t spi_task_handle = NULL;
static volatile bool spi_task_stop = false;

/* ── SPI Slave Config ──────────────────────────────────────────── */

#define SPI_HOST       SPI2_HOST
#define PIN_MOSI       6
#define PIN_MISO       5
#define PIN_SCK        4
#define PIN_CS         7
#define TRANSFER_SIZE  1024

WORD_ALIGNED_ATTR uint8_t spi_rxBuf[TRANSFER_SIZE];
WORD_ALIGNED_ATTR uint8_t spi_txBuf[TRANSFER_SIZE];

/* Last received SPI data — binary state + config cache */
static uint32_t spi_transaction_count = 0;
static bool new_spi_data = false;

/* Local binary caches (populated from SPI RX frames) */
static device_config_t local_cfg;
static spi_state_t     local_state;
static uint32_t        local_cfg_seq = 0;
static bool            stm32_synced = false;
static bool            first_boot = true;

/* ── Audio streaming state ────────────────────────────────────── */

#define AUDIO_RING_SIZE 4096   /* ~256ms at 8kHz */
#define AUDIO_RING_MASK (AUDIO_RING_SIZE - 1)
static int16_t audio_ring[AUDIO_RING_SIZE];
static volatile uint32_t audio_ring_head = 0;
static volatile uint32_t audio_ring_tail = 0;
static volatile bool audio_streaming = false;

/* Audio WebSocket clients (separate from status WS) */
#define MAX_AUDIO_CLIENTS 2
static int audio_ws_fds[MAX_AUDIO_CLIENTS] = {0};

static void audio_ws_add(int fd) {
    for (int i = 0; i < MAX_AUDIO_CLIENTS; i++) {
        if (audio_ws_fds[i] == 0) { audio_ws_fds[i] = fd; return; }
    }
}

static void audio_ws_remove(int fd) {
    for (int i = 0; i < MAX_AUDIO_CLIENTS; i++) {
        if (audio_ws_fds[i] == fd) { audio_ws_fds[i] = 0; return; }
    }
}

static int audio_ws_count(void) {
    int n = 0;
    for (int i = 0; i < MAX_AUDIO_CLIENTS; i++)
        if (audio_ws_fds[i] != 0) n++;
    return n;
}

/* Command queue: browser → SPI (ring buffer, 8 deep) */
#define CMD_QUEUE_SIZE 8
static qt_spi_cmd_t cmd_queue[CMD_QUEUE_SIZE];
static volatile uint8_t cmd_head = 0, cmd_tail = 0;
static portMUX_TYPE cmd_mux = portMUX_INITIALIZER_UNLOCKED;
static uint32_t cmd_seq_counter = 0;

static void cmd_enqueue(uint8_t cmd_type, const uint8_t *payload, uint8_t payload_len)
{
    portENTER_CRITICAL(&cmd_mux);
    uint8_t next = (cmd_head + 1) % CMD_QUEUE_SIZE;
    if (next != cmd_tail) {  /* not full */
        memset(&cmd_queue[cmd_head], 0, sizeof(qt_spi_cmd_t));
        cmd_queue[cmd_head].cmd = cmd_type;
        cmd_queue[cmd_head].seq = ++cmd_seq_counter;
        if (payload && payload_len > 0) {
            if (payload_len > 56) payload_len = 56;
            memcpy(cmd_queue[cmd_head].payload, payload, payload_len);
        }
        cmd_head = next;
    }
    portEXIT_CRITICAL(&cmd_mux);
}

static bool cmd_dequeue(qt_spi_cmd_t *out)
{
    portENTER_CRITICAL(&cmd_mux);
    if (cmd_tail == cmd_head) {
        portEXIT_CRITICAL(&cmd_mux);
        return false;
    }
    memcpy(out, &cmd_queue[cmd_tail], sizeof(qt_spi_cmd_t));
    cmd_tail = (cmd_tail + 1) % CMD_QUEUE_SIZE;
    portEXIT_CRITICAL(&cmd_mux);
    return true;
}

/* Legacy JSON helpers — kept for parsing config from browser */

/* ── WiFi AP Config ────────────────────────────────────────────── */

#define MAX_CONNECTIONS 4

/* Pick a non-overlapping 2.4 GHz channel from {1, 6, 11} based on the
 * SoftAP MAC. Deterministic per device, spreads units across channels
 * without an RF survey. */
static uint8_t wifi_pick_channel(void)
{
    static uint8_t cached = 0;
    if (cached) return cached;
    uint8_t mac[6];
    if (esp_read_mac(mac, ESP_MAC_WIFI_SOFTAP) == ESP_OK) {
        static const uint8_t ch_set[] = {1, 6, 11};
        /* XOR only the NIC-unique bytes; OUI is constant across Espressif parts. */
        uint8_t h = mac[3] ^ mac[4] ^ mac[5];
        cached = ch_set[h % 3];
    } else {
        cached = 6;
    }
    return cached;
}

/* Device name — used as the WiFi SSID.
 * Default: "QT_XXXX" where XXXX = last 4 hex digits of MAC.
 * Updated to station ID when learned from STM32 via SPI. */
static char device_name[32] = "";

static esp_netif_t *wifi_ap_netif = NULL;

/* ── WebSocket Client Tracking ─────────────────────────────────── */

#define MAX_WS_CLIENTS 4
static int ws_fds[MAX_WS_CLIENTS] = {0};
static httpd_handle_t ws_server = NULL;

static void ws_add_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == 0) {
            ws_fds[i] = fd;
            ESP_LOGI(TAG, "WS client added: fd=%d", fd);
            return;
        }
    }
}

static void ws_remove_client(int fd)
{
    for (int i = 0; i < MAX_WS_CLIENTS; i++) {
        if (ws_fds[i] == fd) {
            ws_fds[i] = 0;
            ESP_LOGI(TAG, "WS client removed: fd=%d", fd);
            return;
        }
    }
}

static void ws_broadcast(const char *json)
{
    if (!ws_server) return;

    httpd_ws_frame_t ws_pkt = {
        .type = HTTPD_WS_TYPE_TEXT,
        .payload = (uint8_t *)json,
        .len = strlen(json),
    };

