chriskinal/QuailTracker/esp32_bridge/src/main.c
        local_cfg_seq++;
        local_cfg.cfg_seq = local_cfg_seq;
        ESP_LOGI(TAG, "Config updated (seq=%lu)", (unsigned long)local_cfg_seq);
        return;
    }

    if (strstr(json, "set_detect")) {
        char *p;
        if ((p = strstr(json, "\"mission\":")) != NULL)
            local_cfg.missionMode = (uint8_t)atoi(p + 10);
        if ((p = strstr(json, "\"conf\":")) != NULL)
            local_cfg.detConfThresh = (uint8_t)atoi(p + 7);
        if ((p = strstr(json, "\"winStep\":")) != NULL)
            local_cfg.detWindowStep = (uint8_t)atoi(p + 10);

        local_cfg_seq++;
        local_cfg.cfg_seq = local_cfg_seq;
        cmd_enqueue(SPI_CMD_SET_DETECT, NULL, 0);
        return;
    }

    if (strstr(json, "set_schedule")) {
        char *p;
        if ((p = strstr(json, "\"sunEn\":")) != NULL)
            local_cfg.sunriseEnabled = (uint8_t)atoi(p + 8);
        if ((p = strstr(json, "\"sunB\":")) != NULL)
            local_cfg.sunriseBefore = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"sunA\":")) != NULL)
            local_cfg.sunriseAfter = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"setEn\":")) != NULL)
            local_cfg.sunsetEnabled = (uint8_t)atoi(p + 8);
        if ((p = strstr(json, "\"setB\":")) != NULL)
            local_cfg.sunsetBefore = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"setA\":")) != NULL)
            local_cfg.sunsetAfter = (uint16_t)atoi(p + 7);
        if ((p = strstr(json, "\"nWin\":")) != NULL)
            local_cfg.numWindows = (uint8_t)atoi(p + 7);
        if ((p = strstr(json, "\"wins\":[")) != NULL) {
            p += 8;
            for (int i = 0; i < local_cfg.numWindows * 2 && i < 16; i++) {
                local_cfg.windows[i] = (uint16_t)atoi(p);
                char *next = strchr(p, ',');
                if (next) p = next + 1; else break;
            }
        }

        local_cfg_seq++;
        local_cfg.cfg_seq = local_cfg_seq;
        return;
    }
}

static volatile bool stm32_wake_pending = false;  /* set from any task; spi_task drains */

static esp_err_t ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        /* WebSocket handshake — track this client */
        int fd = httpd_req_to_sockfd(req);
        ws_add_client(fd);
        ESP_LOGI(TAG, "WS handshake: fd=%d — queuing STM32 wake", fd);
        /* Don't call stm32_wake() inline here. It does spi_slave_free()
         * + 10ms vTaskDelay, which blocks the HTTP server response and
         * races with spi_task. iOS sees the WS handshake stall, aborts
         * the connection, and drops the AP. Defer to spi_task instead. */
        stm32_wake_pending = true;
        return ESP_OK;
    }

    /* Receive command from browser — two-step: get length, then payload. */
    httpd_ws_frame_t ws_pkt = {0};
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;

    esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, 0);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WS recv header error: %s", esp_err_to_name(ret));
        return ESP_OK;
    }
    if (ws_pkt.len == 0 || ws_pkt.len >= 512) {
        ESP_LOGW(TAG, "WS frame len=%d (skip)", (int)ws_pkt.len);
        return ESP_OK;
    }

    uint8_t *buf = calloc(1, ws_pkt.len + 1);
    if (!buf) {
        ESP_LOGE(TAG, "WS malloc fail (%d bytes)", (int)ws_pkt.len);
        return ESP_OK;
    }
    ws_pkt.payload = buf;
    ret = httpd_ws_recv_frame(req, &ws_pkt, ws_pkt.len);
    if (ret == ESP_OK && ws_pkt.len > 0) {
        buf[ws_pkt.len] = '\0';
        ws_process_command((char *)buf);
    } else if (ret != ESP_OK) {
        ESP_LOGW(TAG, "WS recv payload error: %s", esp_err_to_name(ret));
    }
    free(buf);
    return ESP_OK;
}

/* ── OTA Firmware Update Handler ────────────────────────────────── */

static esp_err_t ota_handler(httpd_req_t *req)
{
    ESP_LOGI(TAG, "OTA update started, content_len=%d", req->content_len);

    /* Read first chunk and validate ESP32 image magic byte (0xE9) */
    char buf[1024];
    int ret = httpd_req_recv(req, buf, sizeof(buf));
    if (ret <= 0) {
        ws_broadcast("{\"otaErr\":\"No data received\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }
    if ((uint8_t)buf[0] != 0xE9) {
        ESP_LOGE(TAG, "Not ESP32 firmware (magic=0x%02X, expected 0xE9)", (uint8_t)buf[0]);
        ws_broadcast("{\"otaErr\":\"Invalid firmware — not an ESP32 binary\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    const esp_partition_t *update_partition = esp_ota_get_next_update_partition(NULL);
    if (!update_partition) {
        ws_broadcast("{\"otaErr\":\"No OTA partition\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    esp_ota_handle_t ota_handle;
    esp_err_t err = esp_ota_begin(update_partition, OTA_WITH_SEQUENTIAL_WRITES, &ota_handle);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_ota_begin failed: %s", esp_err_to_name(err));
        ws_broadcast("{\"otaErr\":\"OTA begin failed\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }

    /* Write first chunk that we already read */
    err = esp_ota_write(ota_handle, buf, ret);
    if (err != ESP_OK) {
        esp_ota_abort(ota_handle);
        ws_broadcast("{\"otaErr\":\"Write error\"}");
        httpd_resp_sendstr(req, "ERR");
        return ESP_FAIL;
    }
    int received = ret;
    int total = req->content_len;

    /* Continue receiving and writing */
    while (received < total) {
        ret = httpd_req_recv(req, buf, sizeof(buf));
        if (ret <= 0) {
            if (ret == HTTPD_SOCK_ERR_TIMEOUT) continue;
            esp_ota_abort(ota_handle);
            ws_broadcast("{\"otaErr\":\"Receive error\"}");
            httpd_resp_sendstr(req, "ERR");
            return ESP_FAIL;
        }

        err = esp_ota_write(ota_handle, buf, ret);
        if (err != ESP_OK) {
            esp_ota_abort(ota_handle);
            ws_broadcast("{\"otaErr\":\"Write error\"}");
            httpd_resp_sendstr(req, "ERR");
            return ESP_FAIL;
        }

