chriskinal/QuailTracker/esp32_bridge/src/main.c
    /* Stage 2: Stop SPI task, free SPI slave, flash STM32 from partition */
    spi_task_stop = true;
    /* Wait for SPI task to exit (it checks the flag every iteration) */
    for (int i = 0; i < 50 && spi_task_handle != NULL; i++)
        vTaskDelay(pdMS_TO_TICKS(100));
    ESP_LOGI(TAG, "SPI task stopped");

    if (spi_initialized) {
        spi_slave_free(SPI_HOST);
        spi_initialized = false;
    }

    int rc = stm32_flash_from_partition(part, (uint32_t)received, stm32_flash_progress);

    /* Re-initialize SPI slave and restart task */
    spi_slave_init();
    spi_task_stop = false;
    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);

    if (rc != STM32_FLASH_OK) {
        stm32_flash_pct = -1;
        char errmsg[64];
        snprintf(errmsg, sizeof(errmsg), "Flash failed (error %d)", rc);
        ESP_LOGE(TAG, "%s", errmsg);
        httpd_resp_set_status(req, "500 Internal Server Error");
        httpd_resp_set_type(req, "text/plain");
        httpd_resp_sendstr(req, errmsg);
        return ESP_FAIL;
    }

    stm32_flash_pct = 100;
    ESP_LOGI(TAG, "STM32 flash complete, device rebooted");
    httpd_resp_sendstr(req, "OK");
    stm32_flash_pct = -1;
    return ESP_OK;
}

/* ── Audio WebSocket Handler ────────────────────────────────────── */

static esp_err_t ws_audio_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        int fd = httpd_req_to_sockfd(req);
        audio_ws_add(fd);
        ESP_LOGI(TAG, "Audio WS handshake: fd=%d", fd);
        return ESP_OK;
    }

    /* Receive command from browser (start/stop/channel change) */
    httpd_ws_frame_t ws_pkt = {0};
    ws_pkt.type = HTTPD_WS_TYPE_TEXT;

    esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, 0);
    if (ret != ESP_OK || ws_pkt.len == 0 || ws_pkt.len >= 256)
        return ESP_OK;

    uint8_t *buf = calloc(1, ws_pkt.len + 1);
    if (!buf) return ESP_OK;
    ws_pkt.payload = buf;
    ret = httpd_ws_recv_frame(req, &ws_pkt, ws_pkt.len);
    if (ret == ESP_OK) {
        buf[ws_pkt.len] = '\0';
        ws_process_command((char *)buf);
    }
    free(buf);
    return ESP_OK;
}

static httpd_handle_t start_webserver(void)
{
    if (ws_server) return ws_server;  /* already running */

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = 16;
    config.stack_size = 8192;
    config.lru_purge_enable = true;    /* close oldest connection when full */
    config.close_fn = on_sock_close;   /* clean up WS client list on disconnect */
    httpd_handle_t server = NULL;

    if (httpd_start(&server, &config) == ESP_OK) {
        httpd_uri_t root = {
            .uri = "/",
            .method = HTTP_GET,
            .handler = root_handler,
        };
        httpd_register_uri_handler(server, &root);

        httpd_uri_t ws = {
            .uri = "/ws",
            .method = HTTP_GET,
            .handler = ws_handler,
            .is_websocket = true,
        };
        httpd_register_uri_handler(server, &ws);

        httpd_uri_t ws_audio = {
            .uri = "/ws_audio",
            .method = HTTP_GET,
            .handler = ws_audio_handler,
            .is_websocket = true,
        };
        httpd_register_uri_handler(server, &ws_audio);

        httpd_uri_t ota = {
            .uri = "/ota",
            .method = HTTP_POST,
            .handler = ota_handler,
        };
        httpd_register_uri_handler(server, &ota);

        httpd_uri_t stm32_ota = {
            .uri = "/ota_stm32",
            .method = HTTP_POST,
            .handler = stm32_ota_handler,
        };
        httpd_register_uri_handler(server, &stm32_ota);

        httpd_uri_t flash_status = {
            .uri = "/flash_status",
            .method = HTTP_GET,
            .handler = flash_status_handler,
        };
        httpd_register_uri_handler(server, &flash_status);

        httpd_uri_t esp_cfg_get = {
            .uri = "/config_esp",
            .method = HTTP_GET,
            .handler = esp_config_get_handler,
        };
        httpd_register_uri_handler(server, &esp_cfg_get);

        httpd_uri_t esp_cfg_post = {
            .uri = "/config_esp",
            .method = HTTP_POST,
            .handler = esp_config_post_handler,
        };
        httpd_register_uri_handler(server, &esp_cfg_post);

        httpd_uri_t api_state = {
            .uri = "/api/state",
            .method = HTTP_GET,
            .handler = api_state_handler,
        };
        httpd_register_uri_handler(server, &api_state);

        /* Register captive portal probe URLs — return 204 so phones
         * don't show portal popup. Any URL typed by user gets resolved
         * to 192.168.9.1 by our DNS, hitting the root "/" handler. */
        const char *probe_uris[] = {
            "/generate_204",
            "/hotspot-detect.html",
            "/ncsi.txt",
            "/connecttest.txt",
            "/redirect",
            "/success.txt",
            NULL
        };
        httpd_uri_t probe = {
            .method = HTTP_GET,
            .handler = catchall_handler,
        };
        for (int i = 0; probe_uris[i]; i++) {
            probe.uri = probe_uris[i];
            httpd_register_uri_handler(server, &probe);
        }

        ESP_LOGI(TAG, "Web server started on port %d", config.server_port);
    }
    ws_server = server;
    return server;
}

/* ── WiFi AP Start/Stop ────────────────────────────────────────── */

static void stm32_wake(void);  /* fwd decl — defined later in file */

/* WiFi AP event handler: wake STM32 whenever a station joins so the
 * user's incoming config commands land on a live STM32. */
static void wifi_ap_event_handler(void *arg, esp_event_base_t base,
                                  int32_t id, void *data)
{
    if (base == WIFI_EVENT && id == WIFI_EVENT_AP_STACONNECTED) {
        wifi_event_ap_staconnected_t *e = (wifi_event_ap_staconnected_t *)data;
        ESP_LOGI(TAG, "AP STA connected (aid=%d) — queuing STM32 wake", e->aid);
        /* Defer to spi_task — same reason as ws_handler. */
        stm32_wake_pending = true;
    }
}

static void wifi_init_netif(void)
{
    /* One-time init of netif + event loop (can't be undone) */
    static bool netif_inited = false;
    if (!netif_inited) {
        ESP_ERROR_CHECK(esp_netif_init());
        ESP_ERROR_CHECK(esp_event_loop_create_default());
        wifi_ap_netif = esp_netif_create_default_wifi_ap();

