chriskinal/QuailTracker/esp32_bridge/src/main.c
        /* Dequeue command — keep in TX frame for up to 5 exchanges
         * to survive SPI CRC errors. STM32 dedup via cmd_seq. */
        static qt_spi_cmd_t pending_cmd = {0};
        static int pending_ttl = 0;

        qt_spi_cmd_t new_cmd;
        if (cmd_dequeue(&new_cmd)) {
            memcpy(&pending_cmd, &new_cmd, sizeof(qt_spi_cmd_t));
            pending_ttl = 5;
        }
        if (pending_ttl > 0) {
            memcpy(&tx->command, &pending_cmd, sizeof(qt_spi_cmd_t));
            flags |= SPI_FLAG_CMD_PENDING;
            pending_ttl--;
        }

        tx->header.flags = flags;
        tx->header.crc16 = spi_frame_crc(tx);

        memset(spi_rxBuf, 0, TRANSFER_SIZE);

        spi_slave_transaction_t trans = {
            .length = TRANSFER_SIZE * 8,
            .tx_buffer = spi_txBuf,
            .rx_buffer = spi_rxBuf,
        };

        esp_err_t ret = spi_slave_transmit(SPI_HOST, &trans, pdMS_TO_TICKS(1000));
        vTaskDelay(pdMS_TO_TICKS(1));

        if (ret == ESP_OK) {
            spi_transaction_count++;

            spi_frame_t *rx = (spi_frame_t *)spi_rxBuf;

            if (rx->header.magic == SPI_FRAME_MAGIC) {
                /* Validate CRC */
                uint16_t expected_crc = spi_frame_crc(rx);
                if (expected_crc != rx->header.crc16) {
                    ESP_LOGW(TAG, "SPI CRC mismatch");
                    continue;
                }

                /* Config sync: adopt if STM32 seq is higher */
                if (rx->header.cfg_seq > local_cfg_seq) {
                    memcpy(&local_cfg, &rx->config, sizeof(device_config_t));
                    local_cfg_seq = rx->header.cfg_seq;
                    stm32_synced = true;
                    ESP_LOGI(TAG, "Config synced from STM32 (seq=%lu)",
                             (unsigned long)local_cfg_seq);
                }

                /* Cache state for web UI */
                if (rx->header.flags & SPI_FLAG_STATE_VALID) {
                    memcpy(&local_state, &rx->state, sizeof(spi_state_t));
                    new_spi_data = true;
                }

                /* Extract audio samples from reserved region */
                if (audio_streaming) {
                    const spi_audio_payload_t *ap =
                        (const spi_audio_payload_t *)rx->_reserved;
                    if (ap->audio_active && ap->num_samples > 0 &&
                        ap->num_samples <= 214) {
                        uint32_t h = audio_ring_head;
                        for (uint16_t i = 0; i < ap->num_samples; i++) {
                            audio_ring[h & AUDIO_RING_MASK] = ap->samples[i];
                            h++;
                        }
                        audio_ring_head = h;
                    }
                }

                /* Sync WiFi SSID to station ID when it changes */
                update_device_name(local_cfg.stationId);
            }
            /* Backward compat: legacy JSON from old STM32 firmware */
            else if (spi_rxBuf[0] == '{') {
                char *msg = (char *)spi_rxBuf;
                msg[TRANSFER_SIZE - 1] = '\0';
                new_spi_data = true;
            }
        }
    }
}

/* ── WebSocket Push Task ───────────────────────────────────────── */

/* Solar state names for JSON */
static const char *solar_names[] = { "Standby", "Charging", "Complete", "Fault" };

static void ws_push_task(void *arg)
{
    static char json_buf[1500];

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(500));

        if (new_spi_data && ws_server) {
            new_spi_data = false;

            const spi_state_t *s = &local_state;
            const device_config_t *c = &local_cfg;

            /* Build GPS time string */
            char gpsTime[12] = "--:--:--";
            if (s->gps_utcTime) {
                uint8_t hh = (uint8_t)(s->gps_utcTime / 10000);
                uint8_t mm = (uint8_t)((s->gps_utcTime / 100) % 100);
                uint8_t ss = (uint8_t)(s->gps_utcTime % 100);
                snprintf(gpsTime, sizeof(gpsTime), "%02d:%02d:%02d",
                         (int)hh, (int)mm, (int)ss);
            }

            /* Build windows array string */
            char winBuf[128] = "";
            {
                int pos = 0;
                for (int i = 0; i < c->numWindows && i < 8; i++) {
                    if (i > 0) winBuf[pos++] = ',';
                    pos += snprintf(winBuf + pos, sizeof(winBuf) - pos,
                                    "%u,%u", c->windows[i*2], c->windows[i*2+1]);
                }
            }

            /* Solar name */
            const char *solar = (s->solar_state < 4) ? solar_names[s->solar_state] : "Unknown";

            /* Temp formatting: sht30 is in 0.01°C */
            int tWhole = s->env_tempC100 / 100;
            int tFrac = (s->env_tempC100 % 100);
            if (tFrac < 0) tFrac = -tFrac;

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wformat-truncation"
            snprintf(json_buf, sizeof(json_buf),
                "{\"bat\":%u,\"temp\":%d.%02d,\"hum\":%u.%u,"
                "\"rec\":%d,\"sd\":%d,\"gps\":%d,\"sat\":%d,"
                "\"station\":\"%s\",\"fw\":\"%s\",\"espFw\":\"%s\","
                "\"lat5\":%ld,\"lon5\":%ld,\"alt1\":%ld,"
                "\"gpsTime\":\"%s\",\"pps\":%d,\"ppsCnt\":%lu,"
                "\"sdFree\":%lu,\"sdTotal\":%lu,"
                "\"solar\":\"%s\","
                "\"recBytes\":%lu,\"ovf\":%lu,\"clip\":%lu,"
                "\"svLat5\":%ld,\"svLon5\":%ld,\"svCnt\":%lu,"
                "\"hFiles\":%lu,\"hSecs\":%lu,\"hDet\":%lu,"
                "\"hBatMin\":%lu,\"hBatMax\":%lu,"
                "\"hTmpMin\":%ld,\"hTmpMax\":%ld,"
                "\"hBoots\":%lu,\"hSdErr\":%lu,\"hGpsLoss\":%lu,"
                "\"mdl\":%d,\"mdlSz\":%lu,\"mdlCls\":%d,"
                "\"detWin\":%lu,\"detHit\":%lu,"
                "\"detSp\":\"%s\",\"detPct\":%d,\"detTm\":\"%s\","
                "\"mission\":%d,\"conf\":%d,\"winStep\":%d,"
                "\"sunEn\":%d,\"sunB\":%u,\"sunA\":%u,"
                "\"setEn\":%d,\"setB\":%u,\"setA\":%u,"
                "\"nWin\":%d,\"wins\":[%s],"
                "\"gain\":%d,\"fmt\":%d,\"hpf\":%u,\"lpf\":%u,\"chunk\":%d,"
                "\"trigEn\":%d,\"trigDb\":%d,\"trigPre\":%d,\"trigPost\":%d,"
                "\"lowBat\":%d,\"autoStop\":%d,\"micHdg\":%u,"
                "\"pwrState\":%d,\"devMode\":%d,\"schedActive\":%d,\"rtcSync\":%d,"
                "\"synced\":%d}",
                (unsigned)s->env_battMv,
                tWhole, tFrac,
                (unsigned)(s->env_humRH100 / 100),
                (unsigned)(s->env_humRH100 / 10 % 10),
                (int)s->rec_active,
                (int)s->rec_sdMounted,
                (int)s->gps_valid,
                (int)s->gps_satellites,
                c->stationId, s->comms_stm32FwVersion, ESP_FW_VERSION,
                (long)s->gps_lat5, (long)s->gps_lon5, (long)s->gps_alt1,
                gpsTime,
                (int)s->gps_ppsSynced, (unsigned long)s->gps_ppsCount,
                (unsigned long)s->rec_sdFreeKb,
                (unsigned long)s->rec_sdTotalKb,
                solar,
                (unsigned long)s->rec_dataBytes,
                (unsigned long)s->rec_overruns,
                (unsigned long)s->audio_clipCount,
                (long)s->survey_lat5, (long)s->survey_lon5,
                (unsigned long)s->survey_count,
                (unsigned long)s->health_filesWritten,
                (unsigned long)s->health_recordingSecs,
                (unsigned long)s->health_detections,
                (unsigned long)s->health_battMinMv,
                (unsigned long)s->health_battMaxMv,
                (long)s->health_tempMinC100, (long)s->health_tempMaxC100,
                (unsigned long)s->health_bootCount,
                (unsigned long)s->health_sdErrors,
                (unsigned long)s->health_gpsFixLosses,
                (int)s->det_modelLoaded,
                (unsigned long)s->det_modelBufSize,
                (int)s->det_modelNumLabels,
                (unsigned long)s->det_windowsProcessed,
                (unsigned long)s->det_hits,
                s->det_lastSpecies,
                (int)s->det_lastConf,
                s->det_lastTime,
                (int)c->missionMode,
                (int)c->detConfThresh,
                (int)c->detWindowStep,
                (int)c->sunriseEnabled,
                (unsigned)c->sunriseBefore,
                (unsigned)c->sunriseAfter,
                (int)c->sunsetEnabled,
                (unsigned)c->sunsetBefore,
                (unsigned)c->sunsetAfter,
                (int)c->numWindows,
                winBuf,
                (int)c->gain,
                (int)c->recFormat,
                (unsigned)c->bpfLow,
                (unsigned)c->bpfHigh,
                (int)c->chunkMinutes,
                (int)c->trigEnabled,
                (int)c->trigDb,
                (int)c->trigPre,
                (int)c->trigPost,
                (int)c->lowBatPct,
                (int)c->autoStop,
                (unsigned)c->micHeading,
                (int)s->pwr_state,
                (int)s->pwr_devMode,
                (int)s->pwr_schedActive,
                (int)s->pwr_rtcSynced,
                (int)stm32_synced);
#pragma GCC diagnostic pop

            ws_broadcast(json_buf);
        }
    }
}

/* ── Audio Push Task ───────────────────────────────────────────── */

static void audio_push_task(void *arg)
{
    /* Buffer for binary WS frame: up to 214 samples = 428 bytes */
    static int16_t push_buf[214];

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(25));

        if (!audio_streaming || !ws_server || audio_ws_count() == 0) {
            /* Drain ring to avoid stale data accumulating */
            audio_ring_tail = audio_ring_head;
            continue;
        }

        /* Copy available samples from ring */
        uint32_t h = audio_ring_head;
        uint32_t t = audio_ring_tail;
        uint32_t avail = h - t;
        if (avail == 0) continue;
        if (avail > 214) {
            /* Drop excess to prevent growing latency */
            t = h - 214;
        }

        uint16_t count = 0;
        while (t != h && count < 214) {
            push_buf[count++] = audio_ring[t & AUDIO_RING_MASK];
            t++;
        }
        audio_ring_tail = t;

