chriskinal/QuailTracker/esp32_bridge/src/main.c
        if (count == 0) continue;

        /* Send binary frame to all audio WS clients */
        httpd_ws_frame_t ws_pkt = {
            .type = HTTPD_WS_TYPE_BINARY,
            .payload = (uint8_t *)push_buf,
            .len = count * sizeof(int16_t),
        };

        for (int i = 0; i < MAX_AUDIO_CLIENTS; i++) {
            if (audio_ws_fds[i] != 0) {
                esp_err_t ret = httpd_ws_send_frame_async(
                    ws_server, audio_ws_fds[i], &ws_pkt);
                if (ret != ESP_OK) {
                    audio_ws_remove(audio_ws_fds[i]);
                }
            }
        }
    }
}

/* ── Captive Portal DNS Server ──────────────────────────────────── */

/* Minimal DNS server: responds to ALL queries with 192.168.9.1.
 * This makes the phone think it needs to "log in", triggering the
 * captive portal popup which loads our web UI automatically. */
static void dns_task(void *arg)
{
    int sock = socket(AF_INET, SOCK_DGRAM, IPPROTO_UDP);
    if (sock < 0) {
        ESP_LOGE(TAG, "DNS: socket failed");
        vTaskDelete(NULL);
        return;
    }

    struct sockaddr_in saddr = {
        .sin_family = AF_INET,
        .sin_port = htons(53),
        .sin_addr.s_addr = htonl(INADDR_ANY),
    };
    if (bind(sock, (struct sockaddr *)&saddr, sizeof(saddr)) < 0) {
        ESP_LOGE(TAG, "DNS: bind failed");
        close(sock);
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "DNS captive portal started on port 53");

    uint8_t buf[512];
    while (1) {
        struct sockaddr_in client;
        socklen_t clen = sizeof(client);
        int len = recvfrom(sock, buf, sizeof(buf), 0, (struct sockaddr *)&client, &clen);
        if (len < 12) continue;  /* too short for DNS header */

        /* Build response: copy query, set response flags, append answer */
        uint8_t resp[512];
        memcpy(resp, buf, len);

        /* Set QR=1 (response), AA=1 (authoritative), RA=1 */
        resp[2] = 0x84;  /* QR=1, Opcode=0, AA=1, TC=0, RD=0 */
        resp[3] = 0x00;  /* RA=0, Z=0, RCODE=0 (no error) */

        /* Answer count = 1 */
        resp[6] = 0x00;
        resp[7] = 0x01;

        /* Append answer: pointer to name in query + type A + class IN + TTL + IP */
        int pos = len;
        resp[pos++] = 0xC0;  /* pointer to name at offset 12 */
        resp[pos++] = 0x0C;
        resp[pos++] = 0x00; resp[pos++] = 0x01;  /* type A */
        resp[pos++] = 0x00; resp[pos++] = 0x01;  /* class IN */
        resp[pos++] = 0x00; resp[pos++] = 0x00;
        resp[pos++] = 0x00; resp[pos++] = 0x0A;  /* TTL = 10s */
        resp[pos++] = 0x00; resp[pos++] = 0x04;  /* data length = 4 */
        resp[pos++] = 192;                        /* 192.168.9.1 */
        resp[pos++] = 168;
        resp[pos++] = 9;
        resp[pos++] = 1;

        sendto(sock, resp, pos, 0, (struct sockaddr *)&client, clen);
    }
}

/* ── Power Management Task ─────────────────────────────────────── */

static void power_mgmt_task(void *arg)
{
    uint32_t duty_cycle_tick = xTaskGetTickCount();

    while (1) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        /* Check if any WiFi clients are connected */
        wifi_sta_list_t sta_list;
        int wifi_clients = 0;
        if (wifi_started && esp_wifi_ap_get_sta_list(&sta_list) == ESP_OK) {
            wifi_clients = sta_list.num;
        }

        /* Reset duty cycle timer while client is connected */
        if (wifi_clients > 0) {
            duty_cycle_tick = xTaskGetTickCount();
        }

        /* Boot grace period: stay awake for 3 min after boot so user can connect */
        uint32_t uptime_ms = xTaskGetTickCount() * portTICK_PERIOD_MS;
        if (uptime_ms < BOOT_GRACE_MS) continue;

        /* WiFi duty cycle: on 20s, then deep sleep 40s.
         * Deep sleep draws ~5µA vs 44mA with WiFi off + CPU idle.
         * On wake, ESP32 reboots — WiFi/NVS reinitialize. */
        if (wifi_duty_cycle && wifi_clients == 0) {
            uint32_t elapsed = (xTaskGetTickCount() - duty_cycle_tick) * portTICK_PERIOD_MS;
            if (elapsed >= WIFI_DUTY_ON_MS) {
                ESP_LOGI(TAG, "Duty cycle: entering deep sleep for %ds", WIFI_DUTY_SLEEP_S);
                esp_deep_sleep(WIFI_DUTY_SLEEP_S * 1000000ULL);
                /* Does not return — ESP32 reboots on wake */
            }
        }

        /* Laser wake: deep sleep indefinitely, wake on GPIO0 high.
         * Stay awake while WiFi clients are connected + 30s grace period. */
        if (laser_wake_enabled && wifi_clients == 0) {
            uint32_t elapsed = (xTaskGetTickCount() - duty_cycle_tick) * portTICK_PERIOD_MS;
            if (elapsed >= (LASER_IDLE_SLEEP_S * 1000)) {
                ESP_LOGI(TAG, "Laser wake: entering deep sleep (GPIO%d wake)", PIN_LASER_WAKE);
                esp_err_t err = esp_deep_sleep_enable_gpio_wakeup(
                    1ULL << PIN_LASER_WAKE, ESP_GPIO_WAKEUP_GPIO_HIGH);
                if (err != ESP_OK) {
                    ESP_LOGE(TAG, "GPIO wake setup FAILED: %s", esp_err_to_name(err));
                } else {
                    vTaskDelay(pdMS_TO_TICKS(100));  /* let log flush */
                    esp_deep_sleep_start();
                    /* Does not return — ESP32 reboots on wake */
                }
            }
        }
    }
}

/* ── Laser Wake Sensor (GPIO0 phototransistor) ─────────────────── */

static void laser_sensor_init(void)
{
    gpio_config_t io = {
        .pin_bit_mask = (1ULL << PIN_LASER_WAKE),
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,  /* external 10K pull-down */
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&io);
    ESP_LOGI(TAG, "Laser wake sensor on GPIO%d", PIN_LASER_WAKE);
}

/* Log wake cause on boot */
static void laser_wake_check(void)
{
    esp_sleep_wakeup_cause_t cause = esp_sleep_get_wakeup_cause();
    if (cause == ESP_SLEEP_WAKEUP_GPIO) {
        ESP_LOGI(TAG, "Woke from deep sleep via laser (GPIO%d)", PIN_LASER_WAKE);
    }
}


/* ── Main ──────────────────────────────────────────────────────── */

