chriskinal/QuailTracker/esp32_bridge/src/main.c
void app_main(void)
{
    printf("\n=== ESP32-C3 QuailTracker Bridge v2 ===\n\n");

    /* FIRST: release STM32 BOOT0/NRST pins to high-Z */
    stm32_pins_init();

    /* Initialize NVS (required for WiFi) */
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ESP_ERROR_CHECK(nvs_flash_init());
    }

    /* Load device name: NVS first, then fall back to MAC-based default */
    if (!load_device_name()) {
        uint8_t mac[6];
        esp_read_mac(mac, ESP_MAC_WIFI_STA);
        snprintf(device_name, sizeof(device_name), "QT_%02X%02X", mac[4], mac[5]);
        ESP_LOGI(TAG, "No saved name, using default: %s", device_name);
    }

    load_duty_cycle();
    load_laser_wake();

    /* Initialize binary SPI protocol state */
    memset(&local_cfg, 0, sizeof(local_cfg));
    local_cfg.micHeading = 0xFFFF;  /* unset until synced from STM32 */
    memset(&local_state, 0, sizeof(local_state));
    local_cfg_seq = 0;
    stm32_synced = false;
    first_boot = true;

    /* Initialize network interface (needed before WiFi) */
    wifi_init_netif();

    wifi_start();
    start_webserver();
    spi_slave_init();
    laser_sensor_init();
    laser_wake_check();

    xTaskCreate(spi_task, "spi_task", 4096, NULL, 3, &spi_task_handle);
    xTaskCreate(ws_push_task, "ws_push", 4096, NULL, 4, NULL);
    xTaskCreate(audio_push_task, "audio_push", 3072, NULL, 4, NULL);
    xTaskCreate(power_mgmt_task, "pwr_mgmt", 4096, NULL, 2, NULL);
    xTaskCreate(dns_task, "dns", 4096, NULL, 2, NULL);

    ESP_LOGI(TAG, "Bridge ready — WiFi AP + SPI + WebSocket");
}
